[
  {
    "교과": "국어",
    "영역": "듣기·말하기",
    "핵심 아이디어": "듣기·말하기는 언어, 준언어, 비언어, 매체 등을 활용하여 서로의 생각과 감정을 주고받는 행위이다. 화자와 청자는 상황 맥락 및 사회·문화적 맥락 속에서 의사소통 목적을 달성하기 위하여 다양한 유형의 담화를 듣고 말한다. 화자와 청자는 의사소통 과정에 협력적으로 참여하고 듣기·말하기 과정에서의 문제를 해결하기 위해 적절한 전략을 사용하여 듣고 말한다. 화자와 청자는 듣기·말하기에 흥미를 가지고 적극적으로 참여하면서 담화 공동체 구성원으로 성장하고, 상호 존중하고 공감하는 소통 문화를 만들어 간다."
  },
  {
    "교과": "국어",
    "영역": "읽기",
    "핵심 아이디어": "읽기는 독자가 자신의 배경지식이나 경험을 활용하여 언어를 비롯한 다양한 기호나 매체로 표현된 글의 의미를 능동적으로 구성하는 행위이다. 독자는 다양한 상황 맥락과 사회·문화적 맥락 속에서 자신의 읽기 목적을 달성하기 위하여 다양한 유형의 글을 읽는다. 독자는 읽기 과정을 점검·조정하며 읽기 과정에서 부딪히는 문제를 해결하기 위해 적절한 읽기 전략을 사용하여 글을 읽는다. 독자는 읽기 경험을 통해 읽기에 대한 긍정적 정서를 형성하고 삶과 공동체의 문제 해결을 위해 공동체 구성원과 함께 독서를 통해 소통함으로써 사회적 독서 문화를 만들어 간다."
  },
  {
    "교과": "국어",
    "영역": "쓰기",
    "핵심 아이디어": "쓰기는 언어를 비롯한 다양한 기호나 매체를 활용하여 인간의 생각과 감정을 글로 표현함으로써 의미를 구성하는 행위이다. 필자는 상황 맥락 및 사회·문화적 맥락 속에서 자신의 의사소통 목적을 달성하기 위하여 다양한 유형의 글을 쓴다. 필자는 쓰기 과정에서 부딪히는 문제를 해결하기 위해 적절한 쓰기 전략을 사용하여 글을 쓴다. 필자는 쓰기 경험을 통해 언어 공동체의 구성원으로 성장하고, 쓰기 윤리를 갖추어 독자와 소통함으로써 바람직한 의사소통 문화를 만들어 간다."
  },
  {
    "교과": "국어",
    "영역": "문법",
    "핵심 아이디어": "문법은 국어의 형식과 내용을 이루는 틀로서 규칙과 원리로 구성·운영되며, 문법 탐구는 문법에 대해 사고하는 활동으로 국어에 대한 총체적 앎을 이끈다. 국어는 체계와 구조를 갖춘 의미 생성 자원이자, 사회적으로 구성된 관습적 규약이며, 공동체의 사고와 가치를 표상하는 문화적 산물이다. 국어 자료는 다양한 맥락에서 만들어지는 의사소통의 결과물로서, 국어 현상을 파악하고 국어 문제를 발견할 수 있는 문법 탐구의 대상이다. 국어 사용자는 일상생활에서 국어 현상과 국어 문제를 탐구하고 성찰하면서 언어 주체로서의 정체성과 국어 의식을 형성한다."
  },
  {
    "교과": "사회",
    "영역": "지리 인식",
    "핵심 아이디어": "지표상에 분포하는 모든 사건과 현상은 절대적, 상대적 위치와 다양한 규모의 영역을 차지한다. 장소는 다른 장소와 차별되는 자연적⋅인문적 성격을 지니며, 특정 장소에 따른 장소감은 개인이나 집단에 따라 다양하다. 지표 세계는 장소적 성격의 동질성, 기능적 상호 관련성, 지역민의 인지 등의 측면에서 다양하게 구분되며, 이렇게 구분된 지역은 고유한 지역성이 나타난다. 지도를 비롯한 다양한 공간자료와 도구를 통한 지리 정보 수집은 장소와 지역의 여러 현상과 사건을 분석하고 해석하며 추론하는 데 필수적이다."
  },
  {
    "교과": "사회",
    "영역": "자연환경과 인간생활",
    "핵심 아이디어": "지표상에는 다양한 기후 특성이 나타나며, 기후 환경은 특정 지역의 생활양식에 중요하게 작용한다. 우리나라와 세계 각지에 다양한 지형 경관이 나타나고, 해당 지역의 인문환경과 인간생활에 중요한 영향을 미친다. 인간은 자연환경에 의존하고 적응하며, 자연환경을 변형시키기도 한다."
  },
  {
    "교과": "사회",
    "영역": "인문환경과 인간생활",
    "핵심 아이디어": "자연적, 인문적 특성은 특정 지역의 인구 분포, 인구 구성, 인구 이동에 영향을 미친다. 장소나 지역에 따라 다양한 문화가 형성되고, 문화는 여러 요인에 의해 변동된다. 도시와 촌락은 입지, 기능, 공간 구조와 경관 등의 측면에서 다양한 유형이 존재하며, 여러 요인에 의해 변화한다. 인간의 경제활동은 자원이나 산업구조 등 지역의 특성에 따라 다양한 모습으로 나타나며, 교통과 통신은 시⋅공간적 제약을 감소시키고 지역을 변화시킨다."
  },
  {
    "교과": "사회",
    "영역": "지속가능한 세계",
    "핵심 아이디어": "인간이 거주하기에 유리한 조건은 공간적으로 불균등하게 분포하고, 이에 따라 지역 간 갈등이나 분쟁이 발생한다. 조화를 이루며 살아가려는 인간의 신념 및 활동은 지구환경의 지속가능성을 가능하게 한다. 인류는 공동의 번영과 공존을 위해 지역적 수준에서 지구적 수준까지 다양한 공간적 스케일에서 상호 협력 및 연대가 필요하다."
  },
  {
    "교과": "사회",
    "영역": "정치",
    "핵심 아이디어": "민주주의의 이념과 원리를 실현하기 위해서는 제도와 의식의 개선이 필요하다. 다양한 정치 주체가 정치과정에 참여하며, 민주주의는 여러 제도와 시민 참여를 통해 실현된다. 국제 사회에는 여러 행위 주체가 활동하며, 우리나라를 비롯한 국제 사회의 행위 주체는 다양한 국제 문제 해결을 위해 노력한다."
  },
  {
    "교과": "사회",
    "영역": "법",
    "핵심 아이디어": "우리 사회에는 일상을 규율하는 다양한 법들이 있으며, 사람들은 재판을 통해 권리를 실현할 수 있다. 인권 보장을 위해 헌법에 기본권을 규정하고, 국가와 시민은 기본권 보장을 위해 노력한다. 헌법에 따라 우리나라의 국가기관은 국회, 대통령과 행정부, 법원과 헌법재판소 등으로 구성된다."
  },
  {
    "교과": "사회",
    "영역": "경제",
    "핵심 아이디어": "가계와 기업은 합리적 선택을 통해 소비와 금융, 생산 등의 경제활동에 참여하면서 각자의 역할을 수행한다. 시장에서 가격은 수요와 공급을 통해 결정되고 다양한 요인으로 인해 변동한다. 우리나라 경제에서는 경제 성장, 물가 변동, 실업 등의 현상이 나타나며, 세계화 과정에서 다른 나라와의 교역이 활발해지고 있다."
  },
  {
    "교과": "사회",
    "영역": "사회⋅문화",
    "핵심 아이디어": "인간은 사회 속에서 성장하면서 사회적 지위를 가지고 역할을 수행하며, 다양한 갈등과 차별을 인식한다. 우리는 일상생활에서 여러 문화를 접하고 있으며, 이로 인해 다양한 문화를 이해하고 존중하는 태도가 필요하다. 우리 사회는 급격한 사회 변동과 다양한 사회문제를 경험하고 있으며, 이에 대응하기 위해서는 시민의 역할이 중요하다."
  },
  {
    "교과": "사회",
    "영역": "역사 일반",
    "핵심 아이디어": "시대에 따라 지역, 교통·통신, 풍습 등 생활 모습이 달라진다. 과거의 모습을 보여주는 자료는 역사의 증거로 활용된다. 일상생활 속 과거에 관심을 가짐으로써 자신을 역사적 존재로 인식한다."
  },
  {
    "교과": "사회",
    "영역": "지역사",
    "핵심 아이디어": "문화유산은 과거와 현재를 이어주는 자료이다. 지역의 박물관, 기념관, 유적지는 지역의 정체성을 보여준다. 지역의 역사적 문제는 역사 자료를 분석·해석·평가하여 해결한다."
  },
  {
    "교과": "사회",
    "영역": "한국사",
    "핵심 아이디어": "각 시대의 모습에는 당시 사람들의 생활상과 사고방식이 반영된다. 역사 정보나 자료의 분석·해석·판단을 통해 역사 지식을 형성한다. 역사 문제를 해결하면서 역사적 주체로서 실천하는 태도를 갖는다."
  },
  {
    "교과": "수학",
    "영역": "수와 연산",
    "핵심 아이디어": "사물의 양은 자연수, 분수, 소수 등으로 표현되며, 수는 자연수에서 정수, 유리수, 실수로 확장된다. 사칙계산은 자연수에 대해 정의되며 정수, 유리수, 실수의 사칙계산으로 확장되고 이때 연산의 성질이 일관되게 성립한다. 수와 사칙계산은 수학 학습의 기본이 되며, 실생활 문제를 포함한 다양한 문제를 해결하는 데 유용하게 활용된다."
  },
  {
    "교과": "수학",
    "영역": "변화와 관계",
    "핵심 아이디어": "변화하는 현상에 반복적인 요소로 들어있는 규칙은 수나 식으로 표현될 수 있으며, 규칙을 탐구하는 것은 수학적으로 추측하고 일반화하는 데 기반이 된다. 동치 관계, 대응 관계, 비례 관계 등은 여러 현상에 들어있는 대상들 사이의 다양한 관계를 기술하고 복잡한 문제를 해결하는 데 유용하게 활용된다. 수와 그 계산은 문자와 식을 사용하여 일반화되며, 특정한 관계를 만족시키는 미지의 값은 방정식과 부등식을 해결하는 적절한 절차를 거쳐 구해진다. 한 양이 변함에 따라 다른 양이 하나씩 정해지는 두 양 사이의 대응 관계를 나타내는 함수와 그 그래프는 변화하는 현상 속의 다양한 관계를 수학적으로 표현한다."
  },
  {
    "교과": "수학",
    "영역": "도형과 측정",
    "핵심 아이디어": "평면도형과 입체도형은 여러 가지 모양을 범주화한 것이며, 각각의 평면도형과 입체도형은 고유한 성질을 갖는다. 도형의 성질과 관계를 탐구하고 정당화하는 것은 논리적이고 비판적으로 사고하는 데 기반이 된다. 측정은 여러 가지 속성의 양을 비교하고 속성에 따른 단위를 이용하여 양을 수치화함으로써 다양한 현상을 해석하거나 실생활 문제를 해결하는 데 활용된다."
  },
  {
    "교과": "수학",
    "영역": "자료와 가능성",
    "핵심 아이디어": " 자료를 수집, 정리, 해석하는 통계는 자료의 특징을 파악하고 두 집단을 비교하며 자료의 관계를 탐구하는 데 활용된다. 사건이 일어날 가능성을 여러 가지 방법으로 표현하는 것은 불확실성을 이해하는 데 도움이 되며, 가능성을 확률로 수치화하면 불확실성을 수학적으로 다룰 수 있게 된다. 자료를 이용하여 통계적 문제해결 과정을 실천하고 생활 속의 가능성을 탐구하는 것은 미래를 예측하고 합리적인 의사 결정을 하는 데 기반이 된다."
  },
  {
    "교과": "과학",
    "영역": "운동과 에너지",
    "핵심 아이디어": " 자연과 일상생활 속의 여러 가지 힘은 물체의 속력과 운동 방향을 변화시키고, 물체의 운동은 힘과 에너지를 통해 예측할 수 있으며, 이는 안전한 일상생활의 토대가 된다. 전하와 전류는 다양한 전기와 자기 현상을 일으키고, 전기와 자기에 대한 성질은 전구, 전동기 등 여러 가지 전기 기구의 작동 원리로 유용하게 활용된다. 열은 온도가 높은 곳에서 낮은 곳으로 이동하며, 일상생활에서는 단열 등 다양한 분야에 물질의 열적 성질이나 열의 이동 방식이 이용된다. 빛과 소리는 반사, 굴절, 진동 등 파동의 특성을 가지며, 그 특성은 거울, 렌즈, 악기, 색의 구현 등 편리하고 심미적인 삶에 도움이 된다."
  },
  {
    "교과": "과학",
    "영역": "물질",
    "핵심 아이디어": " 물질은 여러 가지 상태로 존재하며, 구성 입자의 운동에 따라 물질의 상태와 물리적 성질이 변한다. 물질의 상태 변화 및 화학 반응에는 에너지 출입이 수반되며, 이는 일상생활에 유용하게 활용된다. 물질은 서로 구분할 수 있는 고유한 특성을 가지며, 물질의 특성은 일상생활의 다양한 혼합물 분리에 이용된다. 화학 반응을 통해 물질은 다른 물질로 변하며, 화학 반응의 규칙성은 새로운 물질의 생성 원리가 된다."
  },
  {
    "교과": "과학",
    "영역": "생명",
    "핵심 아이디어": " 생물은 세포로 이루어져 있고, 여러 구성 단계가 유기적으로 연관되어 있으며, 조화로운 작용을 통해 건강한 몸을 유지한다. 식물은 광합성으로 양분을 만들며, 생물은 호흡을 통해 생명 활동에 필요한 에너지를 얻는다. 동물은 다양한 감각 기관을 통해 자극을 받아들이고, 신경계와 호르몬의 작용을 통해 반응한다. 생물은 생식을 통해 자손을 생산하고, 생물의 형질은 유전자에 의해 자손에게 전달되며, 생물의 유전 현상은 사람의 가계에서도 관찰된다. 우리 주변의 다양한 생물은 환경과 영향을 주고받으며 밀접한 관계를 맺고 있으며, 생물다양성은 생태계와 인간의 삶과도 밀접하게 관련되어 있다."
  },
  {
    "교과": "과학",
    "영역": "지구와 우주",
    "핵심 아이디어": " 지구계는 지권, 수권, 기권, 생물권 등으로 구성되며, 이러한 지구계 구성 요소들이 상호작용을 통해 에너지와 물질을 교환하는 과정에서 다양한 자연 현상들이 발생한다. 암석과 화석, 지구 내부를 탐구함으로써 지질시대 동안 지구 환경과 생물의 변천 과정을 밝혀낼 수 있다. 물은 땅과 바다, 대기 등으로 끊임없이 순환하면서 지표의 특징을 변화시키고 지하구조를 만든다. 지구의 기후시스템은 태양 복사와 지구 복사, 인간 활동 등의 영향을 받으며, 이러한 요인들이 복합적으로 상호작용하여 나타난 기상 현상과 기후변화는 우리 생활과 지속가능성에 영향을 미친다. 태양계는 행성 및 소천체 등으로 구성되며, 생성 과정에 따라 태양계 천체의 표면은 다양하게 나타난다. 별의 표면 온도, 크기, 질량, 거리 등을 결정하는 데 관측 자료와 증거 기반 해석 등이 활용된다."
  },
  {
    "교과": "과학",
    "영역": "과학과 사회",
    "핵심 아이디어": " 과학 탐구를 통해 얻은 과학기술은 질병의 발생 원인 규명과 예방법 마련 등 인류 복지에 기여하고, 인류가 처한 여러 가지 재난 상황 극복에 활용된다. 과학기술은 자원과 에너지 등의 효율적 이용 방안을 제공하여 지속가능한 사회에 기여한다. 과학기술의 발달은 미래 사회의 모습과 직업에 영향을 미치며, 개인은 이러한 미래 사회의 모습과 새로운 진로를 탐색하며 자신의 삶을 준비한다."
  }
]